package homework;


public class RSPGame {

	
	public static void main(String[] args) {
		
		
		
	} // main

} // end class

/*

	[문제] 가위 바위 보 게임
	- 가위(1), 바위(2), 보자기(3)으로 설정한다.
	- 컴퓨터는 난수 1 ~ 3 사이의 숫자를 발생한다.
	- 기본 금액은 1000원을 기본으로 설정한다.
	- 돈이 떨어지면(0 이하이면) 게임을 계속할지 물어보고 계속하려면 현금 입력을 받고 다시 게임을 한다.
	
	[실행결과]
	가위(1), 바위(2), 보자기(3) 입력 : 1
	배팅 금액 : 100
	결과를 보시려면 Enter를 치세요
	
	컴퓨터 바위, 나는 가위
	ㅠㅠ..졌다
	현재 금액은 900윈
	---------------------
	
	가위(1), 바위(2), 보자기(3) 입력 : 1
	배팅 금액 : 100
	결과를 보시려면 Enter를 치세요
	
	컴퓨터 보자기, 나는 가위
	야~호 이겼다.
	현재 금액은 -100윈
	
	또 할래 (y/n) : n
	프로그램을 종료합니다.
	
	또는
	또 할래 (y/n) : y
	insert coin :

*/
